In [2]:
import numpy as np
import pandas as pd

#### Select a single column from a DataFrame.

In [3]:
a=pd.DataFrame({
    "name":["luffy","zoro"],
    "age":[20,22]
})

In [4]:
a

    name  age
0  luffy   20
1   zoro   22

In [5]:
a["name"].to_frame()

    name
0  luffy
1   zoro

#### Select specific rows using iloc[].

In [6]:
a=pd.DataFrame({
    "name":["luffy","zoro"],
    "age":[20,22]
})
a.iloc[0].to_frame()

          0
name  luffy
age      20

#### Apply conditional filtering (Age > 30).

In [7]:


data = {
    "Name": [
        "Alice", "Bob", "Charlie", "David", "Eva",
        "Frank", "Grace", "Hannah", "Ian", "Jack",
        "Karen", "Leo", "Mona", "Nina", "Oscar",
        "Paul", "Quincy", "Rachel", "Steve", "Tina"
    ],
    "Age": [
        25, 30, 22, 28, 35,
        40, 27, 32, 29, 24,
        31, 26, 33, 21, 38,
        36, 23, 34, 29, 28
    ]
}

df = pd.DataFrame(data)
print(df)

       Name  Age
0     Alice   25
1       Bob   30
2   Charlie   22
3     David   28
4       Eva   35
5     Frank   40
6     Grace   27
7    Hannah   32
8       Ian   29
9      Jack   24
10    Karen   31
11      Leo   26
12     Mona   33
13     Nina   21
14    Oscar   38
15     Paul   36
16   Quincy   23
17   Rachel   34
18    Steve   29
19     Tina   28

In [8]:
a=df[df["Age"]>30]
a

      Name  Age
4      Eva   35
5    Frank   40
7   Hannah   32
10   Karen   31
12    Mona   33
14   Oscar   38
15    Paul   36
17  Rachel   34

In [13]:
df.loc[df["Age"]>30,"Name"]

4        Eva
5      Frank
7     Hannah
10     Karen
12      Mona
14     Oscar
15      Paul
17    Rachel
Name: Name, dtype: object

In [10]:
df["Age"]>30

0     False
1     False
2     False
3     False
4      True
5      True
6     False
7      True
8     False
9     False
10     True
11    False
12     True
13    False
14     True
15     True
16    False
17     True
18    False
19    False
Name: Age, dtype: bool

#### Select the first 3 rows of a DataFrame.

In [35]:


data = {
    "Name": [
        "Alice", "Bob", "Charlie", "David", "Eva",
        "Frank", "Grace", "Hannah", "Ian", "Jack",
        "Karen", "Leo", "Mona", "Nina", "Oscar",
        "Paul", "Quincy", "Rachel", "Steve", "Tina"
    ],
    "Age": [
        25, 30, 22, 28, 35,
        40, 27, 32, 29, 24,
        31, 26, 33, 21, 38,
        36, 23, 34, 29, 28
    ]
}

df = pd.DataFrame(data)

df

       Name  Age
0     Alice   25
1       Bob   30
2   Charlie   22
3     David   28
4       Eva   35
5     Frank   40
6     Grace   27
7    Hannah   32
8       Ian   29
9      Jack   24
10    Karen   31
11      Leo   26
12     Mona   33
13     Nina   21
14    Oscar   38
15     Paul   36
16   Quincy   23
17   Rachel   34
18    Steve   29
19     Tina   28

In [18]:
df[:3]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

#### Select only the Name column.

In [19]:


data = {
    "Name": [
        "Alice", "Bob", "Charlie", "David", "Eva",
        "Frank", "Grace", "Hannah", "Ian", "Jack",
        "Karen", "Leo", "Mona", "Nina", "Oscar",
        "Paul", "Quincy", "Rachel", "Steve", "Tina"
    ],
    "Age": [
        25, 30, 22, 28, 35,
        40, 27, 32, 29, 24,
        31, 26, 33, 21, 38,
        36, 23, 34, 29, 28
    ]
}

df = pd.DataFrame(data)

df["Name"].to_frame()

       Name
0     Alice
1       Bob
2   Charlie
3     David
4       Eva
5     Frank
6     Grace
7    Hannah
8       Ian
9      Jack
10    Karen
11      Leo
12     Mona
13     Nina
14    Oscar
15     Paul
16   Quincy
17   Rachel
18    Steve
19     Tina

#### Select rows 2â€“4 and columns Name and Age using iloc[].

In [20]:

data = {
    "Name": [
        "Alice", "Bob", "Charlie", "David", "Eva",
        "Frank", "Grace", "Hannah", "Ian", "Jack",
        "Karen", "Leo", "Mona", "Nina", "Oscar",
        "Paul", "Quincy", "Rachel", "Steve", "Tina"
    ],
    "Age": [
        25, 30, 22, 28, 35,
        40, 27, 32, 29, 24,
        31, 26, 33, 21, 38,
        36, 23, 34, 29, 28
    ]
}

df = pd.DataFrame(data)
df[2:5]

      Name  Age
2  Charlie   22
3    David   28
4      Eva   35

In [22]:
df.iat[19,0]

'Tina'

#### Filter rows where Salary is between 50,000 and 80,000.

In [23]:
names = [f"Person{i}" for i in range(1, 51)]

# Generate 50 random salaries between 20000 and 120000
salaries = np.random.randint(20000, 120001, size=50)

# Create DataFrame
df = pd.DataFrame({
    "Name": names,
    "Salary": salaries
})

print(df)

        Name  Salary
0    Person1   61694
1    Person2   58227
2    Person3  102811
3    Person4   46575
4    Person5  106927
5    Person6   48021
6    Person7   94832
7    Person8   77372
8    Person9   25143
9   Person10   80325
10  Person11   72966
11  Person12   82225
12  Person13   49170
13  Person14   90417
14  Person15  108410
15  Person16   71769
16  Person17   78213
17  Person18   86373
18  Person19   77505
19  Person20   49773
20  Person21   61232
21  Person22   45995
22  Person23   60821
23  Person24  100091
24  Person25   57632
25  Person26   65112
26  Person27   80223
27  Person28   66207
28  Person29   93154
29  Person30   97598
30  Person31   97383
31  Person32   36822
32  Person33   36122
33  Person34   83136
34  Person35   63110
35  Person36   54960
36  Person37   36087
37  Person38   97837
38  Person39   47436
39  Person40  110518
40  Person41   36466
41  Person42   79335
42  Person43   98159
43  Person44  100623
44  Person45  116139
45  Person46   55765
46  Person47   73801
47  Person48   75076
48  Person49   99875
49  Person50   66719

In [28]:
(df[(df["Salary"]>50000)&(df["Salary"]<100000)])[["Name","Salary"]]

        Name  Salary
0    Person1   61694
1    Person2   58227
6    Person7   94832
7    Person8   77372
9   Person10   80325
10  Person11   72966
11  Person12   82225
13  Person14   90417
15  Person16   71769
16  Person17   78213
17  Person18   86373
18  Person19   77505
20  Person21   61232
22  Person23   60821
24  Person25   57632
25  Person26   65112
26  Person27   80223
27  Person28   66207
28  Person29   93154
29  Person30   97598
30  Person31   97383
33  Person34   83136
34  Person35   63110
35  Person36   54960
37  Person38   97837
41  Person42   79335
42  Person43   98159
45  Person46   55765
46  Person47   73801
47  Person48   75076
48  Person49   99875
49  Person50   66719

In [52]:
filtered = df[(df["Salary"] >= 50000) & (df["Salary"] <= 80000)]
print(filtered)

        Name  Salary
4    Person5   55447
6    Person7   52076
7    Person8   52765
9   Person10   50135
11  Person12   77005
16  Person17   71503
17  Person18   51143
25  Person26   60171
26  Person27   53028
29  Person30   75757
39  Person40   53479
41  Person42   74260
43  Person44   77948
49  Person50   53692